1. BPS => multi index
2. pd.melt
3. pd.crosstab
4. pd.read_sql      => membaca query
5. pd.read_sql_table => table



Next:
1. bagaimana kalau datanya waktu

In [3]:
import pandas as pd
import numpy as np

### Melt

In [6]:
cheese = pd.DataFrame({'first': ['John', 'Mary'],
                       'last': ['Doe', 'Bo'],
                       'height': [5.5, 6.0],
                       'weight': [130, 150]})
cheese

  first last  height  weight
0  John  Doe     5.5     130
1  Mary   Bo     6.0     150

In [7]:
cheese.melt(id_vars=['first', 'last'])

  first last variable  value
0  John  Doe   height    5.5
1  Mary   Bo   height    6.0
2  John  Doe   weight  130.0
3  Mary   Bo   weight  150.0

In [8]:
cheese.melt(id_vars=['first', 'last'], var_name='parameter', value_name="nilai")

  first last parameter  nilai
0  John  Doe    height    5.5
1  Mary   Bo    height    6.0
2  John  Doe    weight  130.0
3  Mary   Bo    weight  150.0

### Crosstab

In [11]:
foo, bar, dull, shiny, one, two = 'foo', 'bar', 'dull', 'shiny', 'one', 'two'

a = np.array([foo, foo, bar, bar, foo, foo], dtype=object)
b = np.array([one, one, two, one, two, one], dtype=object)
c = np.array([dull, dull, shiny, dull, dull, shiny], dtype=object)
pd.crosstab(a, [b, c], rownames=['a'], colnames=['b', 'c'])

b    one        two
c   dull shiny dull shiny
a
bar    1     0    0     1
foo    2     1    1     0